{"createDate": "1485925471", "commentType": "comment", "userDisplayName": "John F. McBride", "userTitle": "NULL", "assetURL": "http://www.nytimes.com/2017/01/31/opinion/the-trump-administration-love-it-or-leave-it.html", "userID": 22502625, "userURL": "NULL", "editorsSelection": 0, "commentTitle": "<br/>", "assetID": 3464944, "rgt": 549, "userLocation": "Seattle", "statusID": 2, "updateDate": "1485925507", "status": "approved", "lft": 542, "commentBody": "I had a long conversation today with a long time friend, who wasn't so friendly anymore after the campaign and election. <br/><br/>He keeps telling me I just don't get it. Trump is what we need he says. He says he was forced by the Democrats to vote for Trump. Forced. That's a word he used a lot. The Democrats just keep using the same old people he says. How do we expect anything to change? Queen Hillary he called her, the one anointed by the Democrats to rightfully take the throne he described it.<br/><br/>Trump will change all that. This old friend wasn't to be forced to vote for Hillary because the DNC didn't have the sense to read the writing on the wall and put up Bernie who would have overthrown the system. Bernie and Trump are equivalents in his mind.<br/><br/>In his mind he was willing to throw away all that he liked about Barack if it meant defying the DNC.<br/><br/>But people, this old friend isn't alone. Go out on the blogs. Read what is believed and what is being said by those who voted for Trump in the states that gave him the winning electoral votes. Doesn't matter if you don't like it. I didn't like discovering, over and over, that no amount of rational argument would change me friends mind.<br/><br/>And those minds find a common country Trump and his politburo, which is what it is. Ironic, isn't it, that Russia may have caused this victory, and we have a White House structured like a Russian government, complete with a NSC staffed, not by experts in intelligence and defense, but politburo members.", "replyCount": 3, "recommendationCount": 62, "commentID": 21319781, "approveDate": "1485925507", "parentID": null, "replies": {"comments": [{"createDate": "1485928689", "commentType": "userReply", "parentUserDisplayName": "John F. McBride", "userDisplayName": "CK", "userTitle": "NULL", "parentID": 21319781, "userURL": "NULL", "editorsSelection": false, "commentTitle": "<br/>", "trusted": 0, "depth": 1, "userLocation": "PA", "recommendations": 0, "updateDate": "1485968356", "status": "approved", "commentBody": "Fortunately, your friend - and his friends – don't get to vote for almost another 22 months. In the meantime, Congress will be voting.<br/><br/>The question, I think is whether the Republicans will continue to hang with Trump to make the most of their majorities in both houses of Congress while they can. Time isn't their friend.<br/><br/>If Trump &amp; his gang keep issuing cruel, hateful, and counterproductive EOs like this one, congressional Republicans may have to decide whether they would be better off getting their bills signed by a President Pence. <br/><br/>While my own politics are 180 degrees from Pence, at least Pence isn't a sociopath. I don't sense Pence would stand for Bannon for a moment on his own, and I imagine there would be a vigorous house-cleaning when a Pence administration began in the wake of an impeachment. Do you think that Ivanka, Jared, Bannon, DeVos, and half of the rest of this motley crew* would make up Pence's inner circle? I don't think so. <br/><br/>*I recognize this remark is patently unfair to motley crews.", "replyCount": 0, "commentID": 21320239, "approveDate": "1485968356", "userID": 60854400, "replies": [], "commentSequence": 21320239, "recommendedFlag": 0}, {"createDate": "1485944199", "commentType": "userReply", "parentUserDisplayName": "John F. McBride", "userDisplayName": "Anne", "userTitle": "NULL", "parentID": 21319781, "userURL": "NULL", "editorsSelection": false, "commentTitle": "<br/>", "trusted": 0, "depth": 1, "userLocation": "Washington", "recommendations": 0, "updateDate": "1485968815", "status": "approved", "commentBody": "I've had conversations with liberal friends who are hand-wringing over how we didn't understand the Trump voters. I wish I thought they were right, that all we need to do is pay more attention to the needs of everyone, talk more, listen more, communicate better.<br/><br/>I grew up in a Red State, and have many family members who voted Republican. I had loving relationships with my family, but we knew better than to discuss politics. They thought I was soft-headed, and I thought they were hard-hearted. Forging bonds does not work, when people have made up their minds.<br/><br/>In all the conversations I had over the course of about a decade of adulthood in Conservative Country, conservative thought seemed to come down to one of two things--\"I've got mine, buddy, and I want more. Bleep you.\" or \"People who are different from me are bad.\" The two ideas actually work together, because the chance of getting a bigger piece of the pie is improved if those Hated Others can be disqualified from competing for it.", "replyCount": 0, "commentID": 21321166, "approveDate": "1485968815", "userID": 70128293, "replies": [], "commentSequence": 21321166, "recommendedFlag": 0}, {"createDate": "1485954889", "commentType": "userReply", "parentUserDisplayName": "John F. McBride", "userDisplayName": "John Xavier III", "userTitle": "NULL", "parentID": 21319781, "userURL": "NULL", "editorsSelection": false, "commentTitle": "n/a", "trusted": 0, "depth": 1, "userLocation": "Manhattan", "recommendations": 1, "updateDate": "1485968839", "status": "approved", "commentBody": "It is you who doesn't understand.  The key is to overthrow, or at least modify, the elitist system.  Bernie would have done it, Trump is doing it.  Different ways, but same basic objective.  Your friend is quite rational.  Not so sure about you. You may not be irrational, but you are one of the confused, mostly but not exclusively on the left, who still don't get it. You will have to be shown.", "replyCount": 0, "commentID": 21323072, "approveDate": "1485968839", "userID": 51078065, "replies": [], "commentSequence": 21323072, "recommendedFlag": 0}]}, "commentSequence": 21319781}