{"lead_paragraph": "The Aviation Volunteer Fire Department's home is a cramped office space on White Plains Road in a working-class section of the southeast Bronx known as Clason Point. Members on night duty sleep in cots or in a camper parked out front. The unit relies on a small second-hand fire truck and two smaller rescue vehicles, including a truck nicknamed Leaks because of its persistent engine issues. There is a small buggy to patrol Orchard Beach in the summertime and a Jet Ski on hand for boating accidents in the East River.", "keywords": [{"name": "glocations", "value": "BRONX (NYC)"}, {"name": "glocations", "value": "NEW YORK CITY"}, {"name": "organizations", "value": "FIRE DEPARTMENT"}, {"name": "subject", "value": "FIRES AND FIREFIGHTERS"}], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9E0DE2D8113FF93BA25751C0A9649D8B63", "section_name": "New York and Region", "multimedia": [], "_id": "4fd2a98f8eb7c8105d8947ca", "print_page": "21", "document_type": "article", "type_of_material": "News", "slideshow_credits": null, "word_count": 1005, "snippet": "The Aviation Volunteer Fire Department's home is a cramped office space on White Plains Road in a working-class section of the southeast Bronx known as Clason Point.     Members on night duty sleep in cots or in a camper parked out front. The unit...", "news_desk": "Metropolitan Desk", "pub_date": "2012-02-18T00:00:00Z", "blog": [], "byline": {"person": [{"rank": 1, "firstname": "Corey", "organization": "", "lastname": "KILGANNON", "role": "reported"}], "original": "By COREY KILGANNON"}, "subsection_name": null, "headline": {"main": "A Team of Firefighters Is Told Not to Respond", "kicker": "CITY ROOM"}, "abstract": "City Room blog; New York City Fire Commissioner Salvatore J Cassano orders Aviation Volunteer Fire Department in the Bronx to stop operating, citing lack of proper training, equipment and authorizations; Aviation's chief, Romeo Toro, contests some of Cassano's assertions, saying that he plans to negotiate with the city to get the department running again, and will resort to legal action if necessary. Photos (M)", "source": "The New York Times"}